<?php
/*************************************************************
Глобальные настройки
*************************************************************/

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//	Настройки главной HTML
//-------------------------------------------
$CNF_head_title = 'PHP MVC skeleton';

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//	Настройки движка
//-------------------------------------------
$CNF_controllers_dir = 'controllers/';
$CNF_controller_index = 'main';         // controller(action) который будет вызываться по умолчанию (основной)
$CNF_models_dir = 'models/';
$CNF_views_dir = 'views/';
$CNF_error_msg = '<span style="color:red; font-weight:bold">Шо за БРЕД!</span>';


//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//	ВХОДНЫЕ ПАРАМЕТРЫ и проверка на валидность
//    Пробуем защитится от SQL-инъекции
//    method - если не задано, то метод валидации = validate_word
//    lenth - контролирует макимальную длину значения
//    upper - значение поднять в верхний регистр, достаточно просто укахать ключ 'upper'=>
//    def - значение по умолчанию
//-------------------------------------------
$CNF_request = array(
  'part_num' => array('lenth'=>20, 'upper'=>1, 'def'=>'1 124 625 001'),
);
?>